<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class DepartmentSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [
            [
                'name' => "Відділення №1",
                'address' => 'Черкаси, бульв. Шевченка, 385',
            ],
            [
                'name' => "Відділення №2",
                'address' => 'Черкаси, вул. Чигиринська, 11/1',
            ],
            [
                'name' => "Відділення №3",
                'address' => 'Черкаси, вул. Пацаєва, 7',
            ],
            [
                'name' => "Відділення №4",
                'address' => 'Черкаси, вул. Гагаріна, 77',
            ],
            [
                'name' => "Відділення №5",
                'address' => 'Черкаси, вул. Благовісна, 269/4',
            ],
            [
                'name' => "Відділення №6",
                'address' => 'Черкаси, вул. Небесної Сотні, 6',
            ],
            [
                'name' => "Відділення №7",
                'address' => 'Черкаси, бульв. Шевченка, 207',
            ],
            [
                'name' => "Відділення №8",
                'address' => 'Черкаси, вул. Гоголя, 258',
            ],
            [
                'name' => "Відділення №9",
                'address' => 'Черкаси, вул. Остафія Дашкевича, 34',
            ],
            [
                'name' => "Відділення №10",
                'address' => 'Черкаси, вул. Хоменка, 15',
            ],
            [
                'name' => "Відділення №11",
                'address' => 'Черкаси, вул. Одеська, 8',
            ],
            [
                'name' => "Відділення №12",
                'address' => 'Черкаси, бульв. Шевченка, 150',
            ],
            [
                'name' => "Відділення №13",
                'address' => 'Черкаси, вул. О. Дашкевича, 20',
            ],
            [
                'name' => "Відділення №14",
                'address' => 'Черкаси, вул. Припортова, 34',
            ],
            [
                'name' => "Відділення №15",
                'address' => 'Черкаси, вул. Молоткова, 20',
            ],
        ];

        DB::table('departments')->insert($data);

    }
}
